app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "reviews" ("thoughts", "rating", "user_id", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["thoughts", "Really good chicken"], ["rating", 1], ["user_id", 3], ["restaurant_id", 1], ["created_at", "2015-11-26 17:15:53.529701"], ["updated_at", "2015-11-26 17:15:53.529701"]]
---
  def create
    @restaurant = Restaurant.find(params[:restaurant_id])
    @review = @restaurant.build_review(review_params, current_user)

    if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 2]]
---
  def destroy
    @review = Review.find(params[:id])
    if current_user
    if @review.user_id == current_user.id
      @review.destroy